"Volume" = "Głośność"; 
"Drawbars" = "Suwaki"; 
"Percussion Level" = "Poziom perkusji"; 
"Percussion Time" = "Czas brzmienia perkusji"; 
"Click" = "Click"; 
"Distortion" = "Zniekształcenie"; 
"Rotary Speaker" = "Głośnik obrotowy"; 


